[
  {
    "id": "meta-quest-3-productivity-workflow",
    "title": "Work Anywhere: My Ultimate Meta Quest 3 Productivity Workflow",
    "slug": "meta-quest-3-productivity-workflow",
    "date": "2025-05-24",
    "author": "Anindya Roy",
    "excerpt": "How I transformed Meta Quest 3 into a portable productivity powerhouse for accessing multiple computers from anywhere. Self-hosted remote access, VR workspace, and zero compromises on workflow efficiency.",
    "tags": ["MetaQuest3", "VR", "RemoteWork", "Productivity", "Guacamole", "ZeroTier", "SelfHosted", "WorkFromAnywhere"],
    "linkedinUrl": "https://www.linkedin.com/pulse/work-anywhere-my-ultimate-meta-quest-3-productivity-workflow-roy-utkyf/",
    "content": [
      {
        "type": "paragraph",
        "text": "Remote work is everywhere, but most solutions still chain you to a physical desk or require carrying multiple devices. What if you could access <strong>all your computers</strong> — Windows desktop, Linux workstation, laptop — from a single, portable device you can use anywhere? That's exactly what I've built with the Meta Quest 3."
      },
      {
        "type": "paragraph",
        "text": "Recent software improvements to Meta Quest have finally made it possible to create a <em>genuinely productive</em> workflow that doesn't just replicate a traditional setup, but actually enhances it for remote and mobile work scenarios."
      },
      {
        "type": "heading",
        "text": "The Problem with Traditional Remote Work"
      },
      {
        "type": "paragraph",
        "text": "As someone who manages infrastructure, writes code, and needs to access multiple machines throughout the day, I faced constant friction:"
      },
      {
        "type": "list",
        "items": [
          "Carrying a laptop everywhere gets heavy and limits screen real estate",
          "VPNs and remote desktop solutions are often clunky or require static IPs",
          "Hotel WiFi and public networks are unreliable and insecure",
          "Traditional remote desktop apps on Quest required awkward keyboard-to-Windows-host connections",
          "Multiple devices mean multiple chargers, cables, and management overhead"
        ]
      },
      {
        "type": "paragraph",
        "text": "I needed something <strong>portable</strong>, <strong>secure</strong>, and <strong>powerful</strong> — a single device that could access everything without compromises."
      },
      {
        "type": "heading",
        "text": "The Solution: Meta Quest 3 as a Universal Interface"
      },
      {
        "type": "paragraph",
        "text": "Here's the complete stack I built:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Meta Quest 3:</strong> The VR headset becomes my universal display and interface",
          "<strong>Guacamole:</strong> Self-hosted, web-based remote desktop gateway supporting RDP, SSH, and VNC",
          "<strong>Linode Hosting:</strong> Cloud server running Guacamole (since I don't have a static home IP)",
          "<strong>ZeroTier:</strong> Free-tier mesh networking connecting all my devices securely without port forwarding",
          "<strong>Keychron K3 Pro Keyboard:</strong> Bluetooth mechanical keyboard connected directly to Quest",
          "<strong>Cherry Dot Mouse:</strong> Portable Bluetooth mouse, also paired to Quest"
        ]
      },
      {
        "type": "paragraph",
        "text": "Everything fits in a small bag. Setup time? <strong>Under 2 minutes</strong>."
      },
      {
        "type": "heading",
        "text": "Why Apache Guacamole?"
      },
      {
        "type": "paragraph",
        "text": "Guacamole is the secret weapon that makes this work. It's a <strong>clientless remote desktop gateway</strong> — you access it through a web browser, so it works on any device with internet access."
      },
      {
        "type": "paragraph",
        "text": "Key advantages:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Protocol Support:</strong> RDP (Windows), SSH (Linux servers), VNC (any system)",
          "<strong>Self-Hosted:</strong> Complete control over security and data",
          "<strong>Web-Based:</strong> Works in Meta Quest's native browser (no app required)",
          "<strong>Multi-Session:</strong> Switch between different computers seamlessly",
          "<strong>Recording & Logging:</strong> Built-in session recording for security/audit",
          "<strong>No Client Software:</strong> Nothing to install on remote machines beyond standard RDP/SSH"
        ]
      },
      {
        "type": "paragraph",
        "text": "I host Guacamole on a Linode VPS ($5-10/month) because I don't have a static IP at home. The Linode instance has a stable, whitelisted IP that I can securely connect to from anywhere."
      },
      {
        "type": "heading",
        "text": "Why ZeroTier Instead of VPN?"
      },
      {
        "type": "paragraph",
        "text": "Traditional VPNs require port forwarding, static IPs, or complex firewall configurations. <strong>ZeroTier eliminates all of that</strong>."
      },
      {
        "type": "paragraph",
        "text": "It creates a <strong>mesh network</strong> where all your devices appear to be on the same LAN, regardless of their physical location:"
      },
      {
        "type": "list",
        "items": [
          "No port forwarding needed",
          "No static IP required",
          "No DynDNS configuration",
          "Works through NAT and firewalls automatically",
          "Free tier supports up to 25 devices",
          "Encrypted peer-to-peer connections"
        ]
      },
      {
        "type": "paragraph",
        "text": "My setup: Guacamole server, Windows desktop, Linux workstation, and Windows laptop all join the same ZeroTier network. They can all reach each other as if they were physically connected to the same router."
      },
      {
        "type": "heading",
        "text": "Why Meta Quest Native UI?"
      },
      {
        "type": "paragraph",
        "text": "Here's where most people get it wrong with Quest productivity setups. Many use dedicated RDP apps or Meta Horizon's built-in remote desktop features."
      },
      {
        "type": "paragraph",
        "text": "<strong>The problem?</strong> Those solutions require your keyboard to be connected to the Windows host machine, not the Quest headset. This creates a terrible workflow:"
      },
      {
        "type": "list",
        "items": [
          "You can't type until you're connected to the remote machine",
          "Switching between machines means re-pairing keyboards",
          "No way to navigate Quest menus while working",
          "Added latency in keyboard input"
        ]
      },
      {
        "type": "paragraph",
        "text": "My approach: <strong>Use Meta Quest's native browser</strong> to access Guacamole's web interface. The keyboard and mouse are paired directly to Quest via Bluetooth. This means:"
      },
      {
        "type": "list",
        "items": [
          "I can type immediately, even before connecting to any machine",
          "Seamlessly switch between different computers in browser tabs",
          "Full Quest menu navigation while working",
          "Zero input latency issues"
        ]
      },
      {
        "type": "paragraph",
        "text": "Recent Quest software updates have made the native browser <em>incredibly</em> capable for this workflow."
      },
      {
        "type": "heading",
        "text": "The Hardware: Portable Input Devices"
      },
      {
        "type": "paragraph",
        "text": "Since I'm connecting peripherals directly to Quest, portability is critical:"
      },
      {
        "type": "paragraph",
        "text": "<strong>Keychron K3 Pro</strong> — Ultra-slim mechanical keyboard with:"
      },
      {
        "type": "list",
        "items": [
          "Bluetooth 5.1 for stable Quest connection",
          "Low-profile mechanical switches (travel-friendly)",
          "Multi-device pairing (switch between Quest and phone)",
          "Great battery life (weeks per charge)",
          "Full-size layout in a compact form factor"
        ]
      },
      {
        "type": "paragraph",
        "text": "<strong>Cherry Dot Mouse</strong> — Minimalist Bluetooth mouse:"
      },
      {
        "type": "list",
        "items": [
          "Incredibly small and portable",
          "Precise tracking (important in VR)",
          "Bluetooth connectivity",
          "Long battery life"
        ]
      },
      {
        "type": "paragraph",
        "text": "Both devices fit in my bag alongside the Quest. Total weight? Less than most laptops."
      },
      {
        "type": "heading",
        "text": "The Workflow in Action"
      },
      {
        "type": "paragraph",
        "text": "Here's what a typical work session looks like:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Step 1:</strong> Put on Meta Quest 3, turn on keyboard and mouse (auto-connect via Bluetooth)",
          "<strong>Step 2:</strong> Open Quest browser, navigate to my Guacamole server",
          "<strong>Step 3:</strong> Log in to Guacamole (2FA enabled for security)",
          "<strong>Step 4:</strong> Select which machine to connect to: Windows desktop (RDP), Linux workstation (SSH), or laptop (VNC)",
          "<strong>Step 5:</strong> Work seamlessly with full keyboard/mouse control",
          "<strong>Step 6:</strong> Switch between machines using browser tabs — no disconnecting/reconnecting needed"
        ]
      },
      {
        "type": "paragraph",
        "text": "I can have multiple sessions open simultaneously: Windows desktop for heavy development, Linux box for Docker containers and infrastructure management, laptop for email and communication."
      },
      {
        "type": "heading",
        "text": "Why This Works So Well"
      },
      {
        "type": "paragraph",
        "text": "After using this setup for months, here's why it's become my primary work environment:"
      },
      {
        "type": "paragraph",
        "text": "<strong>1. True Portability</strong>"
      },
      {
        "type": "list",
        "items": [
          "Quest 3 + keyboard + mouse = ~2kg total",
          "Works anywhere with WiFi or mobile hotspot",
          "No need to carry actual computers",
          "Battery lasts 2-3 hours (plenty for focused work sessions)"
        ]
      },
      {
        "type": "paragraph",
        "text": "<strong>2. Unlimited Screen Real Estate</strong>"
      },
      {
        "type": "list",
        "items": [
          "Virtual screens can be as large as I want",
          "Multiple windows arranged in 3D space",
          "No physical desk space constraints",
          "Privacy — no one can see what you're working on"
        ]
      },
      {
        "type": "paragraph",
        "text": "<strong>3. Complete Security</strong>"
      },
      {
        "type": "list",
        "items": [
          "Self-hosted Guacamole (no third-party access)",
          "ZeroTier encrypted mesh network",
          "2FA on Guacamole login",
          "No data passing through public RDP/VNC servers",
          "Can work on sensitive projects from anywhere"
        ]
      },
      {
        "type": "paragraph",
        "text": "<strong>4. Flexibility</strong>"
      },
      {
        "type": "list",
        "items": [
          "Access Windows, Linux, and macOS machines uniformly",
          "Work from hotel rooms, airports, cafes, coworking spaces",
          "No dependence on local machine capabilities",
          "All processing happens on remote machines (Quest is just display/input)"
        ]
      },
      {
        "type": "paragraph",
        "text": "<strong>5. Cost-Effective</strong>"
      },
      {
        "type": "list",
        "items": [
          "Linode VPS: $5-10/month",
          "ZeroTier: Free tier (up to 25 devices)",
          "Guacamole: Open source (free)",
          "One-time hardware: Quest 3 (~$500) + keyboard (~$100) + mouse (~$50)"
        ]
      },
      {
        "type": "paragraph",
        "text": "Total ongoing cost: <strong>Less than $10/month</strong>. Compare that to enterprise VPN solutions or remote desktop services."
      },
      {
        "type": "heading",
        "text": "Real-World Use Cases"
      },
      {
        "type": "paragraph",
        "text": "I use this setup for:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Infrastructure Management:</strong> SSH into production servers, manage Kubernetes clusters",
          "<strong>Software Development:</strong> Full IDE access on my Windows desktop, compile code remotely",
          "<strong>Security Operations:</strong> Monitor SOC dashboards, respond to incidents from anywhere",
          "<strong>Client Meetings:</strong> Screen share from Quest while traveling (Guacamole supports this)",
          "<strong>Writing & Documentation:</strong> Distraction-free environment for focused work",
          "<strong>Travel:</strong> Work productively from hotel rooms without lugging a laptop"
        ]
      },
      {
        "type": "heading",
        "text": "Technical Setup Details"
      },
      {
        "type": "paragraph",
        "text": "For those interested in replicating this setup:"
      },
      {
        "type": "paragraph",
        "text": "<strong>Guacamole Server Setup:</strong>"
      },
      {
        "type": "list",
        "items": [
          "Linode VPS (Shared CPU plan is sufficient)",
          "Ubuntu 22.04 LTS",
          "Docker + Docker Compose for easy Guacamole deployment",
          "Nginx reverse proxy with Let's Encrypt SSL",
          "Fail2ban for SSH brute-force protection",
          "2FA enabled via TOTP (Google Authenticator)"
        ]
      },
      {
        "type": "paragraph",
        "text": "<strong>ZeroTier Configuration:</strong>"
      },
      {
        "type": "list",
        "items": [
          "Create network at my.zerotier.com (free account)",
          "Install ZeroTier client on all machines (Windows, Linux, Linode VPS)",
          "Authorize devices in ZeroTier dashboard",
          "Configure Guacamole connections to use ZeroTier IPs (e.g., 10.x.x.x)"
        ]
      },
      {
        "type": "paragraph",
        "text": "<strong>Meta Quest 3 Configuration:</strong>"
      },
      {
        "type": "list",
        "items": [
          "Pair Keychron K3 Pro via Bluetooth settings",
          "Pair Cherry Dot mouse via Bluetooth settings",
          "Bookmark Guacamole URL in Quest browser",
          "Enable high-quality browser rendering in Quest settings"
        ]
      },
      {
        "type": "heading",
        "text": "Challenges & Solutions"
      },
      {
        "type": "paragraph",
        "text": "No setup is perfect. Here are issues I encountered and how I solved them:"
      },
      {
        "type": "paragraph",
        "text": "<strong>Challenge: Quest battery life</strong>"
      },
      {
        "type": "paragraph",
        "text": "<em>Solution:</em> 2-3 hours is plenty for focused work sessions. For longer sessions, I use a USB-C power bank clipped to my belt. Elite strap with battery is another option."
      },
      {
        "type": "paragraph",
        "text": "<strong>Challenge: Text readability in VR</strong>"
      },
      {
        "type": "paragraph",
        "text": "<em>Solution:</em> Quest 3's resolution is significantly better than Quest 2. I increase browser zoom to 125-150% for comfortable reading. Recent software updates improved text rendering."
      },
      {
        "type": "paragraph",
        "text": "<strong>Challenge: Network latency on hotel WiFi</strong>"
      },
      {
        "type": "paragraph",
        "text": "<em>Solution:</em> I carry a portable WiFi hotspot (or use phone tethering). Mobile data often has better latency than congested hotel networks. Guacamole's protocol optimization helps too."
      },
      {
        "type": "paragraph",
        "text": "<strong>Challenge: Typing without seeing physical keyboard</strong>"
      },
      {
        "type": "paragraph",
        "text": "<em>Solution:</em> Keychron K3 Pro has clear tactile feedback. Touch typing is essential. After a few sessions, muscle memory kicks in. Quest's passthrough mode can help during initial learning."
      },
      {
        "type": "heading",
        "text": "The Future of VR Productivity"
      },
      {
        "type": "paragraph",
        "text": "This workflow represents where remote work is heading: <strong>device-agnostic, location-independent, and secure by default</strong>."
      },
      {
        "type": "paragraph",
        "text": "Meta Quest 3 is just the beginning. As VR headsets get lighter, higher resolution, and longer battery life, this approach will become mainstream. Imagine:"
      },
      {
        "type": "list",
        "items": [
          "AR glasses that display virtual screens in real environments",
          "AI assistants managing remote connections automatically",
          "Haptic gloves eliminating the need for physical keyboards",
          "5G/6G networks making latency imperceptible",
          "Organizations providing VR headsets instead of laptops"
        ]
      },
      {
        "type": "paragraph",
        "text": "For now, this setup gives me a taste of that future — and it works <em>today</em>."
      },
      {
        "type": "heading",
        "text": "Should You Try This?"
      },
      {
        "type": "paragraph",
        "text": "This setup is ideal if you:"
      },
      {
        "type": "list",
        "items": [
          "Travel frequently and need full computer access",
          "Manage multiple remote machines (servers, desktops, VMs)",
          "Want a private, distraction-free work environment",
          "Value portability over traditional laptop setups",
          "Are comfortable with VR headsets for extended periods",
          "Have technical skills to set up Guacamole and ZeroTier"
        ]
      },
      {
        "type": "paragraph",
        "text": "It's <strong>not</strong> ideal if you:"
      },
      {
        "type": "list",
        "items": [
          "Need to share screens frequently in person",
          "Work in environments where VR headsets are impractical (e.g., open offices)",
          "Require ultra-low latency (e.g., video editing, gaming)",
          "Prefer not to wear a headset for extended periods"
        ]
      },
      {
        "type": "heading",
        "text": "Get Started"
      },
      {
        "type": "paragraph",
        "text": "Want to build your own Meta Quest productivity setup? Here's the roadmap:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Hardware:</strong> Meta Quest 3, portable Bluetooth keyboard, Bluetooth mouse",
          "<strong>Server:</strong> Cloud VPS (Linode, DigitalOcean, AWS Lightsail) running Guacamole",
          "<strong>Networking:</strong> ZeroTier free tier for mesh network",
          "<strong>Security:</strong> SSL certificates (Let's Encrypt), 2FA on Guacamole, firewall rules",
          "<strong>Configuration:</strong> Connect all devices to ZeroTier, configure Guacamole connections"
        ]
      },
      {
        "type": "paragraph",
        "text": "Total setup time: 2-3 hours if you're familiar with Linux and Docker. Worth every minute."
      },
      {
        "type": "paragraph",
        "text": "<em>At TechImbue, we're exploring how VR/AR workspaces can transform remote infrastructure management and security operations. The combination of self-hosted remote access, mesh networking, and modern VR hardware creates possibilities that simply weren't feasible a few years ago. Want to discuss implementing similar solutions for your team? <a href='https://techimbue.com#contact'>Let's connect</a>.</em>"
      }
    ]
  },
  {
    "id": "building-techimbue-with-claude-code",
    "title": "Static Website Magic: Building TechImbue.com with Claude Code, GitHub, and Cloudflare Pages",
    "slug": "building-techimbue-with-claude-code",
    "date": "2025-10-24",
    "author": "Anindya Roy",
    "excerpt": "How I built a professional business website in hours (not weeks) using AI-powered development, version control, and free hosting. Zero cost, zero build tools, maximum impact.",
    "tags": ["ClaudeCode", "Anthropic", "CloudflarePages", "GitHub", "WebDevelopment", "AI", "StaticSite", "NoCode"],
    "linkedinUrl": "https://www.linkedin.com/posts/ranindya_anthropic-claude-code-github-cloudflare-activity-7387534229800316928-eNwL",
    "videoUrl": "https://www.linkedin.com/posts/ranindya_anthropic-claude-code-github-cloudflare-activity-7387534229800316928-eNwL",
    "content": [
      {
        "type": "paragraph",
        "text": "Building a professional business website typically takes weeks of development, design iterations, and deployment configurations. What if I told you it could be done in <strong>hours</strong> — with zero hosting costs, zero build tools, and AI handling the entire development workflow?"
      },
      {
        "type": "paragraph",
        "text": "That's exactly how <a href='https://techimbue.com' target='_blank'>TechImbue.com</a> came to life. The secret? A powerful combination of three technologies: <strong>Anthropic's Claude Code</strong>, <strong>GitHub</strong>, and <strong>Cloudflare Pages</strong>. Static website magic, indeed."
      },
      {
        "type": "heading",
        "text": "The Stack: Three Tools, Zero Cost"
      },
      {
        "type": "paragraph",
        "text": "Let me break down this incredibly efficient development stack:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Claude Code (Anthropic):</strong> AI-powered development assistant that writes HTML, CSS, JavaScript, handles git operations, and manages the entire development workflow through natural language",
          "<strong>GitHub:</strong> Version control and repository hosting (free for public repos)",
          "<strong>Cloudflare Pages:</strong> Lightning-fast global CDN hosting with automatic deployments (free tier is generous)"
        ]
      },
      {
        "type": "paragraph",
        "text": "Total monthly cost? <strong>$0</strong>. Total build tools required? <strong>Zero</strong>. Time to deploy? <strong>Minutes</strong>."
      },
      {
        "type": "heading",
        "text": "How Claude Code Transformed the Workflow"
      },
      {
        "type": "paragraph",
        "text": "Traditional web development involves juggling multiple tools, writing boilerplate code, debugging CSS, configuring build systems, and wrestling with deployment pipelines. Claude Code eliminated <em>all of that</em>."
      },
      {
        "type": "paragraph",
        "text": "Here's what Claude Code handled autonomously:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Design & Development:</strong> Created a modern glassmorphism design with dark monochrome theme and gold accents — matching TechImbue's brand identity perfectly",
          "<strong>Responsive Layout:</strong> Built mobile-first responsive design with proper breakpoints for tablet and desktop",
          "<strong>Interactive Features:</strong> Implemented smooth scrolling, intersection observers for scroll animations, modal systems, mobile menu, and parallax effects",
          "<strong>SEO Optimization:</strong> Added comprehensive meta tags, Open Graph data, Twitter cards, and Schema.org structured data",
          "<strong>Git Management:</strong> Initialized repository, created commits with proper messages, and pushed to GitHub",
          "<strong>Blog System:</strong> Built a JSON-based blog with dynamic rendering (no build tools!)",
          "<strong>Content Integration:</strong> Structured all service offerings, client showcases, founder bio, and book promotion sections"
        ]
      },
      {
        "type": "heading",
        "text": "The Pure Static Approach"
      },
      {
        "type": "paragraph",
        "text": "One of the best decisions was keeping everything pure static — no React, no Vue, no build pipeline, no webpack, no npm hell. Just clean HTML5, CSS3, and vanilla JavaScript (ES6+)."
      },
      {
        "type": "paragraph",
        "text": "Why? Because simplicity scales better than complexity:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Performance:</strong> No framework overhead = blazing fast load times",
          "<strong>Reliability:</strong> No dependencies to break or become outdated",
          "<strong>Maintainability:</strong> Any developer can read and modify the code",
          "<strong>SEO:</strong> Real HTML, real content, search engines love it",
          "<strong>Hosting:</strong> Deploy anywhere, no special requirements"
        ]
      },
      {
        "type": "paragraph",
        "text": "The blog system? It's JSON-based. Posts are stored in <code>posts.json</code>, and JavaScript dynamically renders them. Want to add a new post? Edit the JSON, commit, push. Done. No markdown processors, no static site generators, no build step."
      },
      {
        "type": "heading",
        "text": "Cloudflare Pages: The Deployment Dream"
      },
      {
        "type": "paragraph",
        "text": "Cloudflare Pages might be the most underrated developer tool out there. Here's what you get on the <strong>free tier</strong>:"
      },
      {
        "type": "list",
        "items": [
          "Global CDN with edge caching (your site loads fast everywhere)",
          "Automatic deployments from GitHub (push = deploy)",
          "Unlimited bandwidth (seriously)",
          "Free SSL certificates (automatic HTTPS)",
          "Custom domains (no extra cost)",
          "Atomic deployments (instant rollback if needed)",
          "Preview deployments for branches"
        ]
      },
      {
        "type": "paragraph",
        "text": "Setup time? Connect GitHub repository, click deploy, done. No configuration files, no build commands (we're pure static), no environment variables to manage."
      },
      {
        "type": "video",
        "url": "https://www.linkedin.com/posts/ranindya_anthropic-claude-code-github-cloudflare-activity-7387534229800316928-eNwL",
        "caption": "Watch the full workflow demonstration: Claude Code + GitHub + Cloudflare Pages in action (3:05)"
      },
      {
        "type": "heading",
        "text": "The Development Experience"
      },
      {
        "type": "paragraph",
        "text": "Working with Claude Code felt less like traditional programming and more like collaborating with an expert developer who <em>gets it</em>. I described what I wanted in plain English:"
      },
      {
        "type": "quote",
        "text": "Create a modern website for TechImbue showcasing infrastructure consultancy, cybersecurity, and AI services. Dark theme with gold accents. Glassmorphism effects. Make it look premium and tech-forward."
      },
      {
        "type": "paragraph",
        "text": "Claude Code understood the requirements, made design decisions, implemented best practices, and delivered production-ready code. When I wanted changes, I just asked:"
      },
      {
        "type": "list",
        "items": [
          "\"Add a blog section with JSON-based posts\"",
          "\"Make the hero section more interactive with tech cards\"",
          "\"Add my book promotion with a standout design\"",
          "\"Fix the mobile menu bug where it disappears after multiple clicks\""
        ]
      },
      {
        "type": "paragraph",
        "text": "Every request was handled correctly, with proper error handling, accessibility considerations, and performance optimization. The AI even wrote proper git commit messages explaining what changed and why."
      },
      {
        "type": "heading",
        "text": "What This Means for Businesses"
      },
      {
        "type": "paragraph",
        "text": "This workflow has profound implications for businesses, especially tech consultancies and startups:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Speed to Market:</strong> Launch professional websites in hours, not weeks",
          "<strong>Zero Operating Costs:</strong> Free hosting, free SSL, free CDN, unlimited bandwidth",
          "<strong>AI-Powered Iteration:</strong> Want to change something? Just ask. No hourly rates, no agency fees",
          "<strong>Full Control:</strong> You own the code, the repo, the deployment. No vendor lock-in",
          "<strong>Easy Maintenance:</strong> Add blog posts by editing JSON. Update content with simple HTML changes",
          "<strong>Professional Results:</strong> Modern design, proper SEO, fast performance, mobile-responsive"
        ]
      },
      {
        "type": "paragraph",
        "text": "For a technology consultancy like TechImbue, this demonstrates exactly what we preach: <strong>practical innovation that delivers real business value</strong>."
      },
      {
        "type": "heading",
        "text": "The Technical Details"
      },
      {
        "type": "paragraph",
        "text": "For those interested in the technical architecture:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Tech Stack:</strong> HTML5, CSS3, Vanilla JavaScript (ES6+)",
          "<strong>Design System:</strong> CSS custom properties for theming, glassmorphism effects with backdrop-filter",
          "<strong>Animations:</strong> Intersection Observer API for scroll-triggered animations, CSS transforms for performance",
          "<strong>Blog System:</strong> JSON data store + JavaScript renderer, no build tools",
          "<strong>SEO:</strong> Complete meta tags, Schema.org structured data, semantic HTML",
          "<strong>Hosting:</strong> Cloudflare Pages with edge caching and automatic deployments",
          "<strong>Version Control:</strong> GitHub repository with atomic commits"
        ]
      },
      {
        "type": "paragraph",
        "text": "The entire codebase is clean, commented, and follows modern web standards. No hacks, no workarounds, no technical debt."
      },
      {
        "type": "heading",
        "text": "Lessons Learned"
      },
      {
        "type": "paragraph",
        "text": "After deploying TechImbue.com this way, here are my key takeaways:"
      },
      {
        "type": "list",
        "items": [
          "<strong>AI-powered development is ready for production:</strong> Claude Code produces quality code that follows best practices",
          "<strong>Simplicity beats complexity:</strong> Pure static sites are faster, more reliable, and easier to maintain than framework-heavy SPAs",
          "<strong>Free doesn't mean limited:</strong> Cloudflare Pages' free tier is production-grade",
          "<strong>Iteration speed matters:</strong> Being able to ask for changes in natural language accelerates development massively",
          "<strong>Documentation is critical:</strong> I created CLAUDE.md to help future AI instances work on the codebase efficiently"
        ]
      },
      {
        "type": "heading",
        "text": "Try It Yourself"
      },
      {
        "type": "paragraph",
        "text": "Want to build your own site this way? Here's the workflow:"
      },
      {
        "type": "list",
        "items": [
          "Get access to Claude Code (claude.ai/code)",
          "Create a GitHub repository",
          "Describe your website to Claude Code in natural language",
          "Let it build, test, and commit the code",
          "Connect your GitHub repo to Cloudflare Pages",
          "Deploy (automatic from every push)"
        ]
      },
      {
        "type": "paragraph",
        "text": "That's it. No webpack configs, no package.json, no build scripts, no deployment YAML files. Just clean code and smart automation."
      },
      {
        "type": "heading",
        "text": "The Future of Web Development"
      },
      {
        "type": "paragraph",
        "text": "This approach represents where web development is heading: <strong>AI handles the implementation details while humans focus on vision, strategy, and content</strong>."
      },
      {
        "type": "paragraph",
        "text": "Instead of spending days wrestling with CSS grid bugs or configuring webpack loaders, I spent my time on what matters: defining TechImbue's message, structuring our service offerings, and creating compelling content."
      },
      {
        "type": "paragraph",
        "text": "The technical execution? Claude Code handled it flawlessly."
      },
      {
        "type": "paragraph",
        "text": "<em>This is just the beginning. At TechImbue, we're exploring how AI-powered development workflows can transform not just websites, but entire infrastructure deployments, automation pipelines, and business operations. Want to bring this approach to your organization? <a href='https://techimbue.com#contact'>Let's talk</a>.</em>"
      }
    ]
  },
  {
    "id": "distributed-ai-amd-strix-halo",
    "title": "Running 70B Models Across Two AMD Strix Halo Boxes: Early Results from Distributed AI Research",
    "slug": "distributed-ai-amd-strix-halo",
    "date": "2025-11-02",
    "author": "Anindya Roy",
    "excerpt": "Two days of effort — very early results, but I'm genuinely excited about the possibilities. Successfully running a 70B parameter dense model across two AMD Strix Halo boxes connected via USB4/Thunderbolt 4.",
    "tags": ["LLM", "AMD", "ROCm", "StrixHalo", "DistributedAI", "llamacpp", "EdgeInference"],
    "linkedinUrl": "https://www.linkedin.com/posts/ranindya_gmktec-llm-amd-activity-7390560217777905665-NuIm",
    "videoUrl": "https://www.linkedin.com/posts/ranindya_gmktec-llm-amd-activity-7390560217777905665-NuIm",
    "content": [
      {
        "type": "paragraph",
        "text": "Two days of effort — very early results, but I'm genuinely excited about the possibilities."
      },
      {
        "type": "paragraph",
        "text": "I've successfully run a 70B parameter dense model across two AMD Strix Halo boxes (96GB VRAM each) connected via USB4/Thunderbolt 4 using P2P (peer-to-peer) connection. This is cutting-edge distributed AI inference at the edge."
      },
      {
        "type": "heading",
        "text": "What's Working"
      },
      {
        "type": "list",
        "items": [
          "Dense transformer models running stably across the distributed setup",
          "USB4/Thunderbolt 4 P2P connection providing sufficient bandwidth",
          "96GB VRAM per box enabling large model handling",
          "Successful load balancing across both AMD GPUs"
        ]
      },
      {
        "type": "heading",
        "text": "Current Challenges"
      },
      {
        "type": "list",
        "items": [
          "MoE (Mixture of Experts) architectures failing at load time",
          "Further optimization needed for multi-box coordination",
          "Testing required for various model architectures"
        ]
      },
      {
        "type": "heading",
        "text": "What's Next"
      },
      {
        "type": "paragraph",
        "text": "A research paper documenting these findings is forthcoming. The next phase of this research involves daisy-chaining four Strix Halo units together, which would enable running full-size DeepSeek and Llama models at the edge without cloud dependencies."
      },
      {
        "type": "paragraph",
        "text": "This work has significant implications for:"
      },
      {
        "type": "list",
        "items": [
          "<strong>Privacy-first AI:</strong> Running large models entirely on-premise",
          "<strong>Edge Computing:</strong> Bringing frontier model capabilities to local infrastructure",
          "<strong>Cost Efficiency:</strong> Eliminating cloud API costs for production AI workloads",
          "<strong>Latency Reduction:</strong> Local inference for real-time applications"
        ]
      },
      {
        "type": "video",
        "url": "https://www.linkedin.com/posts/ranindya_gmktec-llm-amd-activity-7390560217777905665-NuIm",
        "caption": "Watch the demonstration of distributed inference running across two AMD Strix Halo boxes (2:48)"
      },
      {
        "type": "heading",
        "text": "Looking for Support"
      },
      {
        "type": "paragraph",
        "text": "I'm seeking sponsorship from AMD, GMKTec, or Framework to continue this research. If you're interested in supporting cutting-edge distributed AI research or want to collaborate, please reach out."
      },
      {
        "type": "paragraph",
        "text": "<em>This research aligns with TechImbue's mission of delivering privacy-first, on-premise AI solutions that give organizations complete control over their data and infrastructure.</em>"
      }
    ]
  }
]
